export const SERIES_SKILL = [
  "개룡의 수호",
  "거극룡의 묵시록",
  "뇌악룡의 투지",
  "눈사자의 투지",
  "동봉룡의 반역",
  "백열룡의 맥동",
  "벽수의 힘",
  "쇄인룡의 굶주림",
  "암기소의 힘",
  "암흑기사의 증표",
  "염옥소의 반역",
  "오메가 공명",
  "천인룡의 투지",
  "파의룡의 수호",
  "포호룡의 힘",
  "해룡의 와뢰",
  "호쇄인룡의 명맥",
  "화룡의 힘",
  "황뢰룡의 힘",
  "흉조룡의 힘",
  "흑식룡의 힘"
];

// length = 21
export const ORDERED_SERIES_SKILL = [
  "거극룡의 묵시록",
  "흑식룡의 힘",
  "흉조룡의 힘",
  "암흑기사의 증표",
  "화룡의 힘",
  "백열룡의 맥동",
  "뇌악룡의 투지",
  "벽수의 힘",
  "해룡의 와뢰",
  "쇄인룡의 굶주림",
  "개룡의 수호",
  "눈사자의 투지",
  "동봉룡의 반역",
  "암기소의 힘",
  "염옥소의 반역",
  "오메가 공명",
  "천인룡의 투지",
  "파의룡의 수호",
  "포호룡의 힘",
  "호쇄인룡의 명맥",
  "황뢰룡의 힘",
]

// export const PREFERRED_SKILL = [
//   "거극룡의 묵시록",
//   "흑식룡의 힘",
//   "흉조룡의 힘",
//   "암흑기사의 증표",
//   "화룡의 힘",
//   "백열룡의 맥동",
//   "뇌악룡의 투지",
//   "벽수의 힘",
//   "해룡의 와뢰",
//   "쇄인룡의 굶주림"
// ]

// export const NOT_PREFERRED_SERIES_SKILL = [
//   "개룡의 수호",
//   "눈사자의 투지",
//   "동봉룡의 반역",
//   "암기소의 힘",
//   "염옥소의 반역",
//   "오메가 공명",
//   "천인룡의 투지",
//   "파의룡의 수호",
//   "포호룡의 힘",
//   "호쇄인룡의 명맥",
//   "황뢰룡의 힘",
// ];

export const GROUP_SKILL = [
  "가죽세공의 광택성",
  "가죽세공의 유연성",
  "갑충의 알림",
  "갑충의 의태",
  "모피의 고양",
  "모피의 유혹",
  "비늘 겹치기 연구",
  "비늘 겹치기 기법",
  "선도자의 안내",
  "수호룡의 맥동",
  "수호룡의 방어",
  "영광의 명예",
  "주인의 긍지",
  "주인의 분노",
  "주인의 혼"
];


// length = 14
export const ORDERED_GROUP_SKILL = [
  "주인의 혼",
  "가죽세공의 광택성",
  "가죽세공의 유연성",
  "갑충의 알림",
  "갑충의 의태",
  "모피의 고양",
  "모피의 유혹",
  "비늘 겹치기 연구",
  "비늘 겹치기 기법",
  "선도자의 안내",
  "수호룡의 맥동",
  "수호룡의 방어",
  "주인의 긍지",
  "주인의 분노"
]

// export const PREFERRED_GROUP_SKILL = [
//   "주인의 혼"
// ]